package by.jonline.module.module1.liner.task15;

//Написать программу которая выводит на экран первые четыре степени числа PI

public class Main {

	public static void main(String[] args) {
		
		int result = (int)((Math.PI - 3) * 10000);
		System.out.println("Первые 4 степени числа PI: " + result);
		
	}

}
